app/controllers/store_controller.rb

SELECT `products`.* FROM `products` ORDER BY `products`.title ASC
---
  def index
    # To list the products by title
    @products = Product.order(:title)