app/views/store/index.html.erb

SELECT `products`.* FROM `products` ORDER BY `products`.updated_at DESC LIMIT 1
---

<% cache ['store', Product.latest] do %>